; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph3 - mode
	thermograph0 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	infrared4 - mode
	image1 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph5)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared4)
	(supports instrument7 spectrograph2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 Star4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star4)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star0)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite3 Star7)
	(pointing satellite4 Star4)
	(have_image Star6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Planet8 image1)
	(have_image Planet9 image1)
	(have_image Star10 image1)
	(have_image Star10 spectrograph5)
	(have_image Star11 spectrograph2)
	(have_image Star11 spectrograph5)
	(have_image Planet12 spectrograph5)
	(have_image Planet12 infrared4)
	(have_image Planet13 image1)
))

)

; plan
1. (turn_to satellite4 star4 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star4)
   goals met: 1 of 14
2. (turn_to satellite3 star7 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star7)
   goals met: 2 of 14
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 2 of 14
4. (calibrate satellite2 instrument7 groundstation5)
   added: (calibrated instrument7)
   goals met: 2 of 14
5. (turn_to satellite2 planet8 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet8)
   goals met: 2 of 14
6. (take_image satellite2 planet8 instrument7 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 3 of 14
7. (take_image satellite2 planet8 instrument7 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 14
8. (turn_to satellite2 planet13 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet13)
   goals met: 4 of 14
9. (take_image satellite2 planet13 instrument7 image1)
   added: (have_image planet13 image1)
   goals met: 5 of 14
10. (turn_to satellite2 planet12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet12)
   goals met: 5 of 14
11. (take_image satellite2 planet12 instrument7 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 6 of 14
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 14
13. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 6 of 14
14. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 6 of 14
15. (take_image satellite0 planet12 instrument2 spectrograph5)
   added: (have_image planet12 spectrograph5)
   goals met: 7 of 14
16. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 7 of 14
17. (take_image satellite0 star10 instrument2 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 8 of 14
18. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 8 of 14
19. (take_image satellite0 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 9 of 14
20. (take_image satellite0 star11 instrument2 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 10 of 14
21. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 10 of 14
22. (take_image satellite0 star6 instrument2 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 11 of 14
23. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 11 of 14
24. (take_image satellite0 star7 instrument2 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 12 of 14
25. (turn_to satellite2 planet9 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet9)
   goals met: 12 of 14
26. (take_image satellite2 planet9 instrument7 image1)
   added: (have_image planet9 image1)
   goals met: 13 of 14
27. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 13 of 14
28. (take_image satellite2 star10 instrument7 image1)
   added: (have_image star10 image1)
   goals met: 14 of 14
